---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewPartsVisibility
source: html/c46f634f-7b3a-bcd2-3105-0667f48ac320.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewPartsVisibility Property

"Parts Visibility"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewPartsVisibility { get; }
```